# LegendComponentDetailLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LegendComponentDetailLevel Property
ParameterTypeId Class See Also
---
"Detail Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LegendComponentDetailLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LegendComponentDetailLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LegendComponentDetailLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace